WMS GeoAdmin.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Plan de test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables pré-définies" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Groupe d&apos;unités" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Contrôleur Boucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1348423957000</longProp>
        <longProp name="ThreadGroup.end_time">1348423957000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="WMS GeoAdmin" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Variables pré-définies" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">wms.geo.admin.ch</stringProp>
          <stringProp name="HTTPSampler.path">?LAYERS=${LAYER}&amp;EXCEPTIONS=application%2Fvnd.ogc.se_inimage&amp;FORMAT=image%2Fpng&amp;TRANSPARENT=true&amp;VERSION=1.1.1&amp;SERVICE=WMS&amp;REQUEST=GetMap&amp;STYLES=&amp;SRS=EPSG%3A21781&amp;BBOX=${bbox}&amp;WIDTH=${width}&amp;HEIGHT=${height}&amp;lang=xx</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Rapport agrégé" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables - layer" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="LAYER" elementType="Argument">
            <stringProp name="Argument.name">LAYER</stringProp>
            <stringProp name="Argument.value">ch.swisstopo.pixelkarte-pk200.metadata</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <BSFPreProcessor guiclass="TestBeanGUI" testclass="BSFPreProcessor" testname="Compute BBOX and picture size" enabled="true">
        <stringProp name="script">// Random size of map, between 800 and 1280
var xPix = Math.floor(Math.random() * (1280 - 800 + 1)) + 800;
var yPix = Math.floor(Math.random() * (1280 - 800 + 1)) + 800;
var resolution = Math.random()*10;
var originY = Math.floor(Math.random() * (900000 - 420000 + 1)) + 420000;
var originX = Math.floor(Math.random() * (350000 - 30000 + 1)) + 30000;
var maxY = originY + xPix*resolution;
var maxX = originX + yPix*resolution;
// store bbox
vars.put(&apos;width&apos;,xPix);
vars.put(&apos;height&apos;,yPix);
vars.put(&apos;bbox&apos;,originY.toString()+&apos;,&apos;+originX.toString()+&apos;,&apos;+maxY.toString()+&apos;,&apos;+maxX.toString());
</stringProp>
        <stringProp name="scriptLanguage">javascript</stringProp>
      </BSFPreProcessor>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>